app/controllers/skills_controller.rb

  def get_common_skills
    render json: Skill.where(is_common: true).select(:id, :name).to_json
---
SELECT "skills"."id", "skills"."name" FROM "skills" WHERE "skills"."is_common" = $1  [["is_common", "t"]]